export interface QuestionModel {
   question: string;
   answer: string;
}

export interface ProductDataModel {
   name: string;
   icon: string;
   duration: number;
   promo: boolean;
   included: string[];
   faq: QuestionModel[];
}

export interface ProductsDataModel {
   [key: string]: ProductDataModel;
}

const ProductsData: Readonly<ProductsDataModel> = {
   housemaid: {
      name: 'Домашни помощници',
      icon: 'cleaning-lady',
      duration: 4,
      promo: true,
      included: [
         'Почистване',
         'Гладене',
         'Измиване на прозорци',
         'Смяна на чаршафи',
         'Измиване на чинии',
         'Простиране'
      ],
      faq: [{
         question: 'Какво представлява?',
         answer: 'Домашната помощница извършва домакинската работа, за която вие вече нямате време. Резервацията се извършва онлайн, само с няколко клика. Можете да поръчате както еднократни, така и абонаментни посещения.'
      }, {
         question: 'Абонамент?',
         answer: 'Абонамента включва минимум 4 посещения.'
      }, {
         question: 'Използвани консумативи?',
         answer: 'Домашните помощници работят с препарати и консумативи на клиентите.'
      }, {
         question: 'Може ли да ме посещава една и съща домашна помощница?',
         answer: 'При избор на абонамент вие ще бъдете посещавани от една и съща домакиня всеки път, като за целта се фиксира един и същи ден и час всяка седмица.'
      }, {
         question: 'Трябва ли да присъствам по време на посещенията?',
         answer: 'Вашето присъствие по време на посещенията е изцяло ваше решение. Единственото важно нещо е да осигурите достъп в началото и начин, по който изпълнителя да обезопаси имота, когато приключи.'
      }]
   },
   cleaning: {
      name: 'Основно почистване',
      icon: 'cleaning',
      duration: 8,
      promo: true,
      included: [
         'ВЪВ ВСИЧКИ ПОМЕЩЕНИЯ: Почистване на най-труднодостъпните места, зад и под мебели, под килими, над гардероби и шкафове; Обезпрашаване на всички вертикални и хоризонтални повърхности; Двустранно измиване на прозорци, дограми и щори;',
         'В КУХНЯТА: Премахване на замърсявания от фурни, котлони и аспиратор; Външно почистване на кухненски шкафове и вътрешно, ако са празни; Почистване и дезинфекция на хладилника(вътрешно, ако е празен);',
         'В БАНЯТА: Цялостна дезинфекция на тоалетни, вана и душ; Почистване на фугите и премахване на котлен камък;',
      ],
      faq: []
   },
   tenants: {
      name: 'Почистване преди/след наематели',
      icon: 'couple',
      duration: 8,
      promo: false,
      included: [
         'ВЪВ ВСИЧКИ ПОМЕЩЕНИЯ: Почистване на най-труднодостъпните места, зад и под мебели, под килими, над гардероби и шкафове. Двустранно измиване на прозорци, дограми и щори.',
         'В КУХНЯТА: Премахване на замърсявания от фурни, котлони и аспиратор. Външно почистване на кухненски шкафове и вътрешно, ако са празни. Почистване и дезинфекция на хладилника(вътрешно, ако е празен).',
         'В БАНЯТА: Цялостна дезинфекция на тоалетни, вана и душ. Почистване на фугите и премахване на котлен камък.',
         'МЕБЕЛИ И МЕКИ НАСТИЛКИ: Пране на тапицерии на дивани и фотьойли. Изпиране на тапицерии на столове и табуретки. Пране на килими и мокети.',
         'МАТРАЦИ: Дълбоко изпиране на матраци за покриване на натрупан фин прах и акари. Премахване на повърхностни петна и замърсявания',
      ],
      faq: []
   },
   renovation: {
      name: 'Почистване след ремонт',
      icon: 'renovation',
      promo: false,
      duration: 8,
      included: [
         'Обезпрашаване',
         'Почистване на дограми и прозорци (двустранно)',
         'Почистване на пръски от боя, латекс, лепила, цимент',
         'Цялостна дезинфекция',
         'Почистване на под с необходимата технология, в зависимост от настилката и замърсяването',
      ],
      faq: [{
         question: 'Какъв е крайният резултат?',
         answer: 'Крайният резултат ще бъде готов дом за нанасяне'
      }]
   },
   furniture: {
      name: 'Пране на мека мебел и килими',
      icon: 'furniture',
      promo: false,
      duration: 8,
      included: [
         'Пране на тапицерии на дивани и фотьойли',
         'Изпиране на тапицерии на столове и табуретки',
         'Почистване на матраци',
         'Пране на килими',
      ],
      faq: [{
         question: 'Къде се извършва услугата?',
         answer: 'Услугата се извършва на място при клиента.'
      }, {
         question: 'Как се извършва?',
         answer: 'Изпълнителите използват специални машини, които перат с вода и препарат.'
      }]
   },
   windows: {
      name: 'Почистване на прозорци',
      icon: 'window',
      promo: true,
      duration: 4,
      included: [
         'Прозорци (двустранно) и дограма',
         'Щори',
      ],
      faq: [{
         question: 'Ефикасност?',
         answer: 'Изпълнителите работят с професионални препарати и машини и са много по-ефективни в работата си от обикновения човек.'
      }]
   }
}

export default ProductsData;