export interface QuestionModel {
   question: string;
   answer: string;
}

export interface ProductDataModel {
   name: string;
   icon: string;
   included: string[];
   faq: QuestionModel[];
}

export interface ProductsDataModel {
   [key: string]: ProductDataModel;
}

const ProductsData: ProductsDataModel = {
   housemaid: {
      name: 'Домашни помощници',
      icon: 'cleaning-lady',
      included: [
         'Почистване на най-труднодостъпните места, зад и под мебели, под килими, над гардероби и шкафове;',
         'Обезпрашаване на всички вертикални и хоризонтални повърхности;',
         'Двустранно измиване на прозорци, дограми и щори;',
      ],
      faq: [{
         question: 'Може ли да ме посещава една и съща домашна помощница?',
         answer: 'Абонамента FIX ви гарантира, че вие ще бъдете посещавани от една и съща домакиня всеки път, като за целта се фиксира един и същи ден и час всяка седмица. При останалите типове услуги, можете да поръчате желания от вас изпълнител само ако е свободен.'
      }, {
         question: 'Има ли абонамент веднъж на две седмици?',
         answer: 'Искате редовни посещения, но веднъж седмично е твърде често. Възползвайте се от "Domestina Club" - само за 6 лв. на месец ще можете да поръчвате еднократни посещения на цената на абонаментни. Допълнително удобство е, че ще виждате календара на изпълнителите две седмици напред, вместо една. При този тип потребление не се гарантира един и същ професионалист за всяко посещение.'
      }]
   },
   cleaning: {
      name: 'Основно почистване',
      icon: 'cleaning',
      included: [
         'Почистване на най-труднодостъпните места, зад и под мебели, под килими, над гардероби и шкафове;',
         'Обезпрашаване на всички вертикални и хоризонтални повърхности;',
         'Двустранно измиване на прозорци, дограми и щори;',
      ],
      faq: [{
         question: 'Може ли да ме посещава една и съща домашна помощница?',
         answer: 'Абонамента FIX ви гарантира, че вие ще бъдете посещавани от една и съща домакиня всеки път, като за целта се фиксира един и същи ден и час всяка седмица. При останалите типове услуги, можете да поръчате желания от вас изпълнител само ако е свободен.'
      }, {
         question: 'Има ли абонамент веднъж на две седмици?',
         answer: 'Искате редовни посещения, но веднъж седмично е твърде често. Възползвайте се от "Domestina Club" - само за 6 лв. на месец ще можете да поръчвате еднократни посещения на цената на абонаментни. Допълнително удобство е, че ще виждате календара на изпълнителите две седмици напред, вместо една. При този тип потребление не се гарантира един и същ професионалист за всяко посещение.'
      }]
   },
   tenants: {
      name: 'Почистване преди/след наематели',
      icon: 'couple',
      included: [
         'Почистване на най-труднодостъпните места, зад и под мебели, под килими, над гардероби и шкафове;',
         'Обезпрашаване на всички вертикални и хоризонтални повърхности;',
         'Двустранно измиване на прозорци, дограми и щори;',
      ],
      faq: [{
         question: 'Може ли да ме посещава една и съща домашна помощница?',
         answer: 'Абонамента FIX ви гарантира, че вие ще бъдете посещавани от една и съща домакиня всеки път, като за целта се фиксира един и същи ден и час всяка седмица. При останалите типове услуги, можете да поръчате желания от вас изпълнител само ако е свободен.'
      }, {
         question: 'Има ли абонамент веднъж на две седмици?',
         answer: 'Искате редовни посещения, но веднъж седмично е твърде често. Възползвайте се от "Domestina Club" - само за 6 лв. на месец ще можете да поръчвате еднократни посещения на цената на абонаментни. Допълнително удобство е, че ще виждате календара на изпълнителите две седмици напред, вместо една. При този тип потребление не се гарантира един и същ професионалист за всяко посещение.'
      }]
   },
   renovation: {
      name: 'Почистване след ремонт',
      icon: 'renovation',
      included: [
         'Почистване на най-труднодостъпните места, зад и под мебели, под килими, над гардероби и шкафове;',
         'Обезпрашаване на всички вертикални и хоризонтални повърхности;',
         'Двустранно измиване на прозорци, дограми и щори;',
      ],
      faq: [{
         question: 'Може ли да ме посещава една и съща домашна помощница?',
         answer: 'Абонамента FIX ви гарантира, че вие ще бъдете посещавани от една и съща домакиня всеки път, като за целта се фиксира един и същи ден и час всяка седмица. При останалите типове услуги, можете да поръчате желания от вас изпълнител само ако е свободен.'
      }, {
         question: 'Има ли абонамент веднъж на две седмици?',
         answer: 'Искате редовни посещения, но веднъж седмично е твърде често. Възползвайте се от "Domestina Club" - само за 6 лв. на месец ще можете да поръчвате еднократни посещения на цената на абонаментни. Допълнително удобство е, че ще виждате календара на изпълнителите две седмици напред, вместо една. При този тип потребление не се гарантира един и същ професионалист за всяко посещение.'
      }]
   },
   furniture: {
      name: 'Пране на мека мебел и килими',
      icon: 'furniture',
      included: [
         'Почистване на най-труднодостъпните места, зад и под мебели, под килими, над гардероби и шкафове;',
         'Обезпрашаване на всички вертикални и хоризонтални повърхности;',
         'Двустранно измиване на прозорци, дограми и щори;',
      ],
      faq: [{
         question: 'Може ли да ме посещава една и съща домашна помощница?',
         answer: 'Абонамента FIX ви гарантира, че вие ще бъдете посещавани от една и съща домакиня всеки път, като за целта се фиксира един и същи ден и час всяка седмица. При останалите типове услуги, можете да поръчате желания от вас изпълнител само ако е свободен.'
      }, {
         question: 'Има ли абонамент веднъж на две седмици?',
         answer: 'Искате редовни посещения, но веднъж седмично е твърде често. Възползвайте се от "Domestina Club" - само за 6 лв. на месец ще можете да поръчвате еднократни посещения на цената на абонаментни. Допълнително удобство е, че ще виждате календара на изпълнителите две седмици напред, вместо една. При този тип потребление не се гарантира един и същ професионалист за всяко посещение.'
      }]
   },
   windows: {
      name: 'Почистване на прозорци',
      icon: 'window',
      included: [
         'Почистване на най-труднодостъпните места, зад и под мебели, под килими, над гардероби и шкафове;',
         'Обезпрашаване на всички вертикални и хоризонтални повърхности;',
         'Двустранно измиване на прозорци, дограми и щори;',
      ],
      faq: [{
         question: 'Може ли да ме посещава една и съща домашна помощница?',
         answer: 'Абонамента FIX ви гарантира, че вие ще бъдете посещавани от една и съща домакиня всеки път, като за целта се фиксира един и същи ден и час всяка седмица. При останалите типове услуги, можете да поръчате желания от вас изпълнител само ако е свободен.'
      }, {
         question: 'Има ли абонамент веднъж на две седмици?',
         answer: 'Искате редовни посещения, но веднъж седмично е твърде често. Възползвайте се от "Domestina Club" - само за 6 лв. на месец ще можете да поръчвате еднократни посещения на цената на абонаментни. Допълнително удобство е, че ще виждате календара на изпълнителите две седмици напред, вместо една. При този тип потребление не се гарантира един и същ професионалист за всяко посещение.'
      }]
   }
}

export default ProductsData;